perf/sync/sync_high_ramp_10000.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 2000 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Positive Ramp
      duration: 600
      arrivalRate: 1
      rampTo: 10000
    - name: Final
      duration: 5
      arrivalRate: 1

scenarios:
  - name: Bbox-9090
    flow:
      - get:
          url: '/sync'