perf/sync/sync_stairs_1000.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 200 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Step-5
      duration: 60
      arrivalRate: 10
    - name: Step-100
      duration: 60
      arrivalRate: 100
    - name: Step-200
      duration: 60
      arrivalRate: 200
    - name: Step-300
      duration: 60
      arrivalRate: 300
    - name: Step-400
      duration: 60
      arrivalRate: 400
    - name: Step-500
      duration: 60
      arrivalRate: 500
    - name: Step-600
      duration: 60
      arrivalRate: 600
    - name: Step-700
      duration: 60
      arrivalRate: 700
    - name: Step-800
      duration: 60
      arrivalRate: 800
    - name: Step-900
      duration: 60
      arrivalRate: 900
    - name: Step-1000
      duration: 60
      arrivalRate: 1000
    - name: Final
      duration: 5
      arrivalRate: 1

scenarios:
  - name: Bbox-9090
    flow:
      - get:
          url: '/sync'